Repository: YurinKonstantin/App10Blutuz
Catalog: BluetoothManager/Strings/*/Resources.resw
Source language: en_us
Languages: ru_ru

# ScanButton.Content
source: Scan
ru_ru: Сканировать

# StatusTextBlock.Text
source: Status: Disconnected
ru_ru: Статус: Не подключено

# InputTextBox.PlaceholderText
source: Enter text to send...
ru_ru: Введите текст для отправки...

# TerminalLogTextBox.PlaceholderText
source: Data exchange log will appear here...
ru_ru: Здесь отобразится лог обмена данными...

# SendButton.Content
source: Send
ru_ru: Отправить

# NavDevices.Content
source: Devices
ru_ru: Устройства

# NavAnalyzer.Content
source: LE Analyzer
ru_ru: Анализатор LE

# MsgBtErrorTitle
source: Bluetooth Error
ru_ru: Ошибка Bluetooth

# MsgBtErrorContent
source: Bluetooth adapter was not found on this device.
ru_ru: На данном устройстве не найден Bluetooth-адаптер.

# StatusPaired
source: Paired
ru_ru: Сопряжено

# StatusAvailable
source: Available
ru_ru: Доступно

# ScanErrorTitle
source: Scan Error
ru_ru: Ошибка сканирования

# MsgCompatErrorTitle
source: Compatibility Error
ru_ru: Ошибка совместимости

# MsgCompatErrorContent
source: Your Bluetooth adapter does not support the required operation standards.
ru_ru: Ваш Bluetooth-адаптер не поддерживает необходимые стандарты работы.

# MsgBtOffTitle
source: Bluetooth is Off
ru_ru: Bluetooth выключен

# MsgBtOffContent
source: Please enable Bluetooth in Windows system settings.
ru_ru: Пожалуйста, включите Bluetooth в системных настройках Windows.

# MsgInitErrorTitle
source: Initialization Error
ru_ru: Ошибка инициализации

# MsgInitErrorContent
source: Failed to check Bluetooth status:
ru_ru: Не удалось проверить статус Bluetooth:

source: Status: Connecting...
ru_ru: Статус: Подключение...

source: Status: Connected to
ru_ru: Статус: Подключено к

# StatusConnError
source: Status: Connection error
ru_ru: Статус: Ошибка подключения

source: Status: Disconnected
ru_ru: Статус: Отключено

# MsgConnErrorTitle
source: Connection Error
ru_ru: Ошибка соединения

# LogOutput
source: [OUTPUT]
ru_ru: [ВЫХОД]

# LogInput
source: [INPUT]
ru_ru: [ВХОД]

# LogSendError
source: [SEND ERROR]
ru_ru: [ОШИБКА ОТПРАВКИ]

# LogConnLost
source: [CONNECTION LOST]
ru_ru: [СОЕДИНЕНИЕ ПОТЕРЯНО]

# ErrorNoSppProfile
source: The device does not support the standard serial port profile (RFCOMM/SPP).
ru_ru: Устройство не поддерживает стандартный профиль последовательного порта (RFCOMM/SPP).

# ErrorDeviceAccess
source: Failed to access the device.
ru_ru: Не удалось получить доступ к устройстве.

# ScanButtonStop
source: Stop
ru_ru: Остановить

# StartServerButton.Content
source: Start Server
ru_ru: Запустить Сервер

# StopServerButton.Content
source: Stop Server
ru_ru: Остановить Сервер

# StatusServerListening
source: Server: Listening for connections...
ru_ru: Сервер: Ожидание подключения...

# StatusServerConnected
source: Server: Client connected!
ru_ru: Сервер: Клиент подключен!

# StatusServerStopped
source: Server: Stopped
ru_ru: Сервер: Остановлен

# ScanButtonStart
source: Scan
ru_ru: Сканировать

# ShowUnknownSwitch.Header
source: Show unknown devices
ru_ru: Показывать неизвестные устройства

# UnknownDeviceLabel
source: [Unknown Device]
ru_ru: [Неизвестное устройство]

# BtnConnect
source: Connect
ru_ru: Подключить

# RadarVeryClose
source: 🔥 Very Close
ru_ru: 🔥 Очень близко

# RadarInRadius
source: ⚡ Within Range
ru_ru: ⚡ В радиусе действия

# RadarFarAway
source: ❄️ Far Away (Weak Signal)
ru_ru: ❄️ Далеко (Слабый сигнал)

# AnalyzerTitle
source: Bluetooth LE Analyzer (PRO)
ru_ru: Анализатор Bluetooth LE (PRO)

# AnalyzerSubtitle
source: Inspection of device GATT characteristics and descriptors
ru_ru: Инспекция GATT-характеристик и дескрипторов устройств

# UnlockProButton.Content
source: Unlock PRO Version
ru_ru: Разблокировать PRO версию

# ProPurchaseSuccessTitle
source: Success!
ru_ru: Успешно!

# ProPurchaseSuccessContent
source: PRO version successfully activated. All features unlocked!
ru_ru: PRO-версия успешно активирована. Все функции разблокированы!

# ProPurchaseFailTitle
source: Purchase Error
ru_ru: Ошибка покупки

# ProPurchaseFailContent
source: Failed to complete the purchase. Please try again.
ru_ru: Не удалось совершить покупку. Пожалуйста, попробуйте снова.

# AnalyzerPromoText.Text
source: This module is designed for advanced diagnostics of Bluetooth Low Energy (BLE) devices. The free version is limited to the basic text terminal.
ru_ru: Этот модуль предназначен для углубленной диагностики Bluetooth Low Energy (BLE) устройств. Бесплатная версия ограничена базовым текстовым терминалом.

# AnalyzerFeature1.Text
source: • Discover and read hidden GATT services and characteristics
ru_ru: • Поиск и чтение скрытых GATT-сервисов и характеристик

# AnalyzerFeature2.Text
source: • Modify and send BLE packet descriptors
ru_ru: • Изменение и отправка дескрипторов пакетов BLE

# AnalyzerFeature3.Text
source: • Log and continuously capture low-level traffic
ru_ru: • Логирование и непрерывный захват низкоуровневого трафика

# BtnScanBle.Content
source: Find BLE Devices
ru_ru: Найти BLE устройства

# ValueLabel.Text
source: Value:
ru_ru: Значение:

# BleComboPlaceholder
source: Select BLE Device...
ru_ru: Выберите BLE устройство..

# ErrorBleScanTitle
source: Scan Error
ru_ru: Ошибка поиска

# ErrorGattTitle
source: GATT Error
ru_ru: Ошибка GATT

# ErrorConnBleTitle
source: BLE Connection Error
ru_ru: Ошибка подключения BLE

# ErrorNoBleDevice
source: Failed to establish connection with the BLE device.
ru_ru: Не удалось установить связь с BLE устройством.

# CharClickToRead
source: Click to read
ru_ru: Нажмите для чтения

# CharWriteOnlyError
source: Error: Write / Notify only
ru_ru: Ошибка: Только для записи / уведомлений

# CharEmptyBuffer
source: Empty data buffer
ru_ru: Пустой буфер данных

# CharReadError
source: Read error. Status:
ru_ru: Ошибка чтения. Статус:

# AppTitle
source: BlueIDE: Bluetooth Terminal and BLE Scanner Analyzer
ru_ru: BlueIDE: Bluetooth Терминал и BLE Сканер Анализатор

# ServerLockTitle
source: Available in BlueIDE PRO
ru_ru: Доступно в BlueIDE PRO

# ServerLockContent
source: The built-in Bluetooth echo server allows you to simulate wireless boards directly inside your PC for loopback testing. Would you like to unlock the PRO version and all advanced tools?
ru_ru: Встроенный Bluetooth эхо-сервер позволяет симулировать работу беспроводных плат прямо внутри ПК для петлевых тестов (Loopback). Хотите разблокировать PRO-версию и все продвинутые инструменты?

# BtnBuyPro
source: Buy PRO
ru_ru: Купить PRO

source: Cancel
ru_ru: Отмена

# AnalyzerHeader
source: Available GATT Services
ru_ru: Доступные GATT Сервисы

# CharacteristicsHeader
source: Characteristics & Data
ru_ru: Характеристики и Данные
